{
    "poems": [
        {
            "title": "The Road Not Taken",
            "author": "Robert Frost",
            "lines": [
                "Two roads diverged in a yellow wood,",
                "And sorry I could not travel both",
                "And be one traveler, long I stood",
                "And looked down one as far as I could",
                "To where it bent in the undergrowth;",
                "",
                "Then took the other, as just as fair,",
                "And having perhaps the better claim,",
                "Because it was grassy and wanted wear;",
                "Though as for that the passing there",
                "Had worn them really about the same,",
                "",
                "And both that morning equally lay",
                "In leaves no step had trodden black.",
                "Oh, I kept the first for another day!",
                "Yet knowing how way leads on to way,",
                "I doubted if I should ever come back.",
                "",
                "I shall be telling this with a sigh",
                "Somewhere ages and ages hence:",
                "Two roads diverged in a wood, and I—",
                "I took the one less traveled by,",
                "And that has made all the difference."
            ],
            "commentary": "My English teacher's favourite poem, one which left a teenage me pensive for days when I first read it. Though the..."
        },
        {
            "title": "We Are Judges",
            "author": "Darren Chang JR",
            "lines": [
                "Shadows of paths bathed in light,",
                "The shades of grey from black to white,",
                "Smudged lines dividing wrong and right,",
                "The blur of twilight between day and night.",
                "",
                "Red glow the suns that set and rise,",
                "On two horizons of two different skies.",
                "Too quick to criticise, to chant, and chastise",
                "When we are but judges unknowing. Unwise."
            ],
            "commentary": "Like most others, I was taught the absolute virtues and sins; reciting the 弟子规 (Students' Rules) was a part of the daily morning routine at my school. In it are guidelines for children to be model students, sons/daughters, mourners, etc. Much of what is taught are inspired by Confucianism, yet another "
        },
        {
            "title": "Aging Away from Home",
            "author": "Darren Chang JR",
            "lines": [
                "Stars of this land",
                "Done injustice by my shaky hand",
                "Stars of this land",
                "Forgive my deteriorating eyesight",
                "For missing you amidst moonlight",
                "Until tonight"
            ],
            "context": [
                "After many a weeks' share of academic and interpersonal troubles, I decided to go for a walk in the park at an hour close to midnight. Whist strolling, the overdue realisation that I now dwell in a land I was unprepared to call home came as gently as the breeze.",
                "",
                "I laid myself down on a bench half-shaded by a tree half-bare, and looked up. The night sky here was unobstructed by the local skyscrapers I was and still am amazed by, but that night, the nakedness of it all brought me relief.",
                "",
                "For the first time since arriving in Hong Kong, I saw, embraced, and sought solace in the stars. Blame the terrible light pollution, my eyes, or my ignorance, but the stars finally shone that night."
            ],
            "explanation": [
                "The distinction between the stars of \"this land\" and the stars at home symbolises my perception of life here as being separate and detached from the life I led at my far away home.",
                "\"Shaky hand\" here symbolises my weariness as a result of an exaggerated aging process, and the troubles that plagued me",
                "The repetition here pivots the intended audience of the following lines to the stars, and emphasises my acknowledgement of them",
                "\"Deteriorating\" here symbolises yet another symptom of aging, and the asking of forgiveness from the inanimate stars symbolise reverence and gratitude towards them",
                "The homonym \"missing\" here symbolise my failure to find the stars till now (due to my ignorance), and my longing for them; \"moonlight\" here symbolise the obvious (my goals, troubles, etc.) that have been at the centre of my attention",
                "The present"
            ],
            "personal": ["Stars are the simple yet valid thoughts and feelings that I have postponed for far too long (such as my homesickness), in favour of the more pressing and immediate concerns - the moon. It was a pleasant respite, when I acknowledged that my most pressing concerns are but a fragment of my necessary thoughts, and that time and attention should be given to them proportionately."]
        }
    ]
}