{
    "poems": [
        {
            "title": "Aging Away from Home",
            "author": "Darren Chang JR",
            "lines": [
                "Stars of this land",
                "Done injustice by my shaky hand",
                "Stars of this land",
                "Forgive my deteriorating eyesight",
                "For missing you amidst moonlight",
                "Until tonight"
            ],
            "context": [
                "After many a weeks' share of academic and interpersonal troubles, I decided to go for a walk in the park at an hour close to midnight. Whist strolling, the overdue realisation that I now dwell in a land I was unprepared to call home came as gently as the breeze.",
                "",
                "I laid myself down on a bench half-shaded by a tree half-bare, and looked up. The night sky here was unobstructed by the local skyscrapers I was and still am amazed by, but that night, the nakedness of it all brought me relief.",
                "",
                "For the first time since arriving in Hong Kong, I saw, embraced, and sought solace in the stars. Blame the terrible light pollution, my eyes, or my ignorance, but the stars finally shone that night."
            ],
            "explanation": [
                "The distinction between the stars of \"this land\" and the stars at home symbolises my perception of life here as being separate and detached from the life I led at my far away home.",
                "\"Shaky hand\" here symbolises my weariness as a result of an exaggerated aging process, and the troubles that plagued me",
                "The repetition here pivots the intended audience of the following lines to the stars, and emphasises my acknowledgement of them",
                "\"Deteriorating\" here symbolises yet another symptom of aging, and the asking of forgiveness from the inanimate stars symbolise reverence and gratitude towards them",
                "The homonym \"missing\" here symbolise my failure to find the stars till now (due to my ignorance), and my longing for them; \"moonlight\" here symbolise the obvious (my goals, troubles, etc.) that have been at the centre of my attention",
                "The present"
            ],
            "personal": [
                "Stars are the simple yet valid thoughts and feelings that I have postponed for far too long (such as my homesickness), in favour of the more pressing and immediate concerns - the moon. It was a pleasant respite, when I acknowledged that my most pressing concerns are but a fragment of my necessary thoughts, and that time and attention should be given to them proportionately."
            ]
        },
        {
            "title": "I am Pride",
            "author": "Darren Chang JR",
            "lines": [
                "I am the master of my choice",
                "But more than me are those I implicate.",
                "My brazen ambitions translate",
                "To recklessness in their eyes.",
                "I am salvation, I am vice,",
                "I am pride.",
                "",
                "I own my errs with my own voice,",
                "But never do I not exonerate",
                "Myself. With much more to immolate",
                "Than what was waveringly wagered,",
                "- I need pride, lest I am unassured",
                "That all will be worth what I believed all to.",
                "",
                "Self-justification is my counterpoise",
                "To the apologies I offer - I placate.",
                "Stake your forgiveness up for trade",
                "For when I return with redemption in hand.",
                "I am the worst of man, I am the best of man,",
                "I am pride."
            ],
            "context": [
                "Chiefly inspired by Jane Austen's Pride and Prejudice, I wished to portray the feelings of remorse and the bitterness of regret that arose from the characters' pride in themselves, their presumptuous judgements, etc.",
                "",
                "I attempt my most experimental rhyme scheme thus far - ABBCCD with ABB repeated across all stanzas, with which I hoped to depict the decaying control and composure one experiences when filled with pride."
            ],
            "explanation": [],
            "personal": [
                "Pride is a consequence of self-awareness, and none are void of it. I disagree with diffidence being a desirable quality, but excessive pride manifests a chronic obnoxiousness which I trust many have seen first-hand. These three stanzas serve as a reminder, mostly for myself, to carry pride in moderation."
            ]
        },
        {
            "title": "Train Ride",
            "author": "Darren Chang JR",
            "lines": [
                "My prose now rests on a thousand shelves,",
                "My ending yet still unfulfilled.",
                "We leave our stories to write themselves,",
                "And wonder \"What if we wrote as we willed?\"",
                "",
                "Staring out the train you took,",
                "I wonder if you liked this view,",
                "So you may describe the way it looked,",
                "To me - this fool who only sees you.",
                "",
                "The train tracks are running beside each other,",
                "Peacefully chaotic, gracefully hypnotic.",
                "I wonder if they will run forever,",
                "Two never to meet, too far by two feet.",
                "",
                "The train tracks screech as I near my stop.",
                "I step into the line of people passing through.",
                "The train doors close for my last backdrop.",
                "I step into a sea of people who aren't you."
            ],
            "context": [],
            "explanation": [],
            "personal": []
        },
        {
            "title": "The Accident",
            "author": "Darren Chang JR",
            "lines": [
                "A poem may contain meanings beyond one's guess,",
                "A fart may contain more than just gas."
            ],
            "context": [
                "I present to everyone my very first work, written around the age of 14 based on a tragic real-life event."
            ],
            "explanation": [
                "A factual statement regarding the polysemy of poems.",
                "I discovered the properties of several states of matter."
            ],
            "personal": [
                "I treasure my 'debut' piece immensely, simply for how happy it makes me whenever I read it."
            ]
        },
        {
            "title": "As I'm pulled along the bier road",
            "author": "Darren Chang JR",
            "lines": [
                "As I'm pulled along the bier road,",
                "My mourners' weeps, I hear them not.",
                "Death has come forth, as was foretold",
                "By Birth. So come, I fear you not.",
                "",
                "In my cold wooden crate I lie",
                "Face to face with my final sky.",
                "When I once still was, I told a lie,",
                "\"Nothing will matter when I die.\"",
                "",
                "My flesh basks in the afterglow.",
                "\"Fallen angel, make me a deal.",
                "I need no more than one morrow,",
                "For none can trounce a dead man's zeal.\""
            ],
            "context": [],
            "explanation": [],
            "personal": []
        },
        {
            "title": "Moon",
            "author": "Darren Chang JR",
            "lines": [
                "\"Mother! Mother! Look at the moon!",
                "It's following us! It'll catch up soon!\"",
                "",
                "\"Oh, my dear child, it must be true!",
                "The moon, like me, is fond of you!\"",
                "",
                "\"When I grow up, I'll fly to the moon!",
                "Then maybe to Mars, or even the stars!",
                "... but, mother, then you would be staying so far...\"",
                "",
                "\"Don't worry, my child. Go explore and discover.",
                "Even though you and I can't always be together,",
                "When we look at the moon, we'll think of each other.\""
            ],
            "context": [],
            "explanation": [],
            "personal": []
        }
    ]
}