[
  {
    "title": "Moon",
    "author": "Darren Chang JR",
    "date": "",
    "content": "\"Mother! Mother! Look at the moon!\nIt's following us! It'll catch up soon!\"\n\n\"Oh, my dear child, it must be true!\nThe moon, like me, is fond of you!\"\n\n\"When I grow up, I'll fly to the moon!\nThen maybe to Mars, or even the stars!\n... but, mother, then you would be staying so far...\"\n\n\"Don't worry, my child. Go explore and discover.\nEven though you and I can't always be together,\nWhen we look at the moon, we'll think of each other.\""
  },
  {
    "title": "As I'm pulled along the bier road",
    "author": "Darren Chang JR",
    "date": "",
    "content": "As I'm pulled along the bier road,\nMy mourners' weeps, I hear them not.\nDeath has come forth, as was foretold\nBy Birth. So come, I fear you not.\n\nIn my cold wooden crate I lie\nFace to face with my final sky.\nWhen I once still was, I told a lie,\n\"Nothing will matter when I die.\"\n\nMy flesh basks in the afterglow.\n\"Fallen angel, make me a deal.\nI need no more than one morrow,\nFor none can trounce a dead man's zeal.\""
  },
  {
    "title": "The Accident",
    "author": "Darren Chang JR",
    "date": "",
    "content": "A poem may contain meanings beyond one's guess,\nA fart may contain more than just gas."
  },
  {
    "title": "Train Ride",
    "author": "Darren Chang JR",
    "date": "",
    "content": "My prose now rests on a thousand shelves,\nMy ending yet still unfulfilled.\nWe leave our stories to write themselves,\nAnd wonder \"What if we wrote as we willed?\"\n\nStaring out the train you took,\nI wonder if you liked this view,\nSo you may describe the way it looked,\nTo me - this fool who only sees you.\n\nThe train tracks are running beside each other,\nPeacefully chaotic, gracefully hypnotic.\nI wonder if they will run forever,\nTwo never to meet, too far by two feet.\n\nThe train tracks screech as I near my stop.\nI step into the line of people passing through.\nThe train doors close for my last backdrop.\nI step into a sea of people who aren't you."
  },
  {
    "title": "I am Pride",
    "author": "Darren Chang JR",
    "date": "",
    "content": "I am the master of my choice\nBut more than me are those I implicate.\nMy brazen ambitions translate\nTo recklessness in their eyes.\nI am salvation, I am vice,\nI am pride.\n\nI own my errs with my own voice,\nBut never do I not exonerate\nMyself. With much more to immolate\nThan what was waveringly wagered,\n- I need pride, lest I am unassured\nThat all will be worth what I believed all to.\n\nSelf-justification is my counterpoise\nTo the apologies I offer - I placate.\nStake your forgiveness up for trade\nFor when I return with redemption in hand.\nI am the worst of man, I am the best of man,\nI am pride."
  },
  {
    "title": "Aging Away from Home",
    "author": "Darren Chang JR",
    "date": "",
    "content": "Stars of this land\nDone injustice by my shaky hand\nStars of this land\nForgive my deteriorating eyesight\nFor missing you amidst moonlight\nUntil tonight"
  }
]
