{
    "posts": [
        {
            "title": "0th Post!",
            "date": "2022-08-30",
            "text": "Dear all,\n\nI welcome you to my platform of monologue, where only my thoughts are mutually known by you and me. What started as a simple page project has now become a simple page project with a blog. Sharing my personal thoughts with unknown strangers on the internet makes me... cautious of my choice of words, everything around me started being cancellable since I started using Twitter.\n\nYes, I am a Computer Science student who has gotten used to zero-based numbering, hence \"0th Post\". Lame nerd joke.\n\nThank you for reading, I hope you enjoy my future entries. I look forward to it."
        },
        {
            "title": "Go to sleep.",
            "date": "2022-09-02",
            "text": "My vigour is getting out of hand. From whence do I gain the energy necessary to skip sleep? Beats me. Lying on my bed awaiting slumber, I can't help but think that I could have spent these extra minutes being productive.\n\nI twist and turn,\nand go for a wee.\nSleep is tomorrow's concern,\ntime for a coding spree.\n\nI am concerned about my physical health for obvious reasons - it's bad enough that my day is mostly spent sitting and typing, yet here I am, with a body (and mind) reluctant to sleep. Yet perhaps just as important is my productivity; I dread the mind-numbing lethargy sleep deprivation brings. Whatever will become of me if this... condition persists?"
        },
        {
            "title": "Where are you 'FROM' from?",
            "date": "2022-10-06",
            "text": "Oh, the visible confusion on my interlocutor's face when I tell them I from Malaysia, but am not Malay.\n\nFriends from monoethnic countries often fail to distinguish between one's \"ethnicity\" and \"nationality\", and understandably so. However, while one's \"nationality\" refers to the sovereign state from whence one receives a legal identification, one's \"ethnicity\" is a cultural affiliation derived from one's parents, who derived it from their parents, cue endless recursion.\n\nAs with anything related to social sciences, definitions are subjective. Since I am holding the microphone of this one-way communication channel and also because you can trust everything you read online, my interpretations are irrefutably correct.\n\nThe titular question was never asked of me, but was made popular by the number 1 exporter of domestic social issues - USA. So when next you find yourself posing this same question, ask yourself, \"What do I want to 'KNOW' know?\" Poorly worded, is it not?"
        }
    ]
}
